20230817060200-how_computers_work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How Computers Work [CM1030-01]</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">How Computers Work [CM1030-01]</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9e043e4">1. What is IT?</a></li>
<li><a href="#orge41316e">2. Computer Architecture</a>
<ul>
<li><a href="#org50813a7">2.1. 1. Hardware Layer</a></li>
<li><a href="#org50d8123">2.2. 2. Operating System Layer</a></li>
<li><a href="#org746e8a5">2.3. 3. Software Layer</a></li>
<li><a href="#orgc39b8c5">2.4. 4. User Layer</a></li>
</ul>
</li>
<li><a href="#org7442819">3. The Modern Computer</a></li>
<li><a href="#orgfc80719">4. Operating Systems</a></li>
<li><a href="#org6f9f4f6">5. Networking</a></li>
<li><a href="#org076f6b5">6. Software</a></li>
<li><a href="#org18169ed">7. Systems Administration</a></li>
<li><a href="#org9df1c7f">8. IT Security</a></li>
</ul>
</div>
</div>
<p>
(Coursera Module)
</p>

<div id="outline-container-org9e043e4" class="outline-2">
<h2 id="org9e043e4"><span class="section-number-2">1.</span> What is IT?</h2>
<div class="outline-text-2" id="text-1">
<p>
IT is essentially the use of digital technology like computers on the Internet to store and process data into useful information.
The IT industry refers to the entire scope of all the jobs and resources that are related to computing technologies within society.
And there are a lot of different types of jobs in this field.
</p>

<p>
<a href="20230817060853-digital_divide.html#ID-7be5f9e0-d58c-4d3f-9fff-8706c9f8f8cc">Digital Divide</a>
</p>

<p>
<a href="20230817063147-computing_pioneers.html#ID-60cfcb90-c159-4770-b7d6-4ef5756c1816">Pioneers in Computing</a>
</p>

<p>
<a href="20230817075458-logic_gates.html#ID-c8f65fea-d52f-4b67-99b6-2faa09557397">Logic Gates</a>
</p>
</div>
</div>

<div id="outline-container-orge41316e" class="outline-2">
<h2 id="orge41316e"><span class="section-number-2">2.</span> Computer Architecture</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org50813a7" class="outline-3">
<h3 id="org50813a7"><span class="section-number-3">2.1.</span> 1. Hardware Layer</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Made up of the physical components of a computer.
</p>
</div>
</div>

<div id="outline-container-org50d8123" class="outline-3">
<h3 id="org50d8123"><span class="section-number-3">2.2.</span> 2. Operating System Layer</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The operating system allows hardware to communicate with the system.
</p>

<p>
Hardware is created by many different manufacturers.
The operating system allows them to be used with our system regardless of where it came from.
</p>
</div>
</div>

<div id="outline-container-org746e8a5" class="outline-3">
<h3 id="org746e8a5"><span class="section-number-3">2.3.</span> 3. Software Layer</h3>
<div class="outline-text-3" id="text-2-3">
<p>
How we as humans interact with our computers.
</p>

<p>
When you use a computer, you're given a vast amount of software that you interact with.
</p>

<p>
Whether it's a mobile app, a web browser, a word processor with an OS itself.
</p>
</div>
</div>

<div id="outline-container-orgc39b8c5" class="outline-3">
<h3 id="orgc39b8c5"><span class="section-number-3">2.4.</span> 4. User Layer</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The most important part of IT is the human element.
While we work with computers every day, it is the user interaction that makes up most of our job from responding to user emails to fixing their computers.
</p>
</div>
</div>
</div>

<div id="outline-container-org7442819" class="outline-2">
<h2 id="org7442819"><span class="section-number-2">3.</span> <a href="20230818060029-the_modern_computer.html#ID-e84553c8-b876-4190-a670-bd533b55a774">The Modern Computer</a></h2>
</div>

<div id="outline-container-orgfc80719" class="outline-2">
<h2 id="orgfc80719"><span class="section-number-2">4.</span> <a href="20230819045220-operating_systems.html#ID-1dcff204-74cf-445d-9357-5c01ca3d2a03">Operating Systems</a></h2>
</div>

<div id="outline-container-org6f9f4f6" class="outline-2">
<h2 id="org6f9f4f6"><span class="section-number-2">5.</span> <a href="20230819074153-networking.html#ID-81cf9704-e90a-4565-9337-3304436a50c2">Networking</a></h2>
</div>

<div id="outline-container-org076f6b5" class="outline-2">
<h2 id="org076f6b5"><span class="section-number-2">6.</span> <a href="20230820050201-software.html#ID-f98f3bbb-9d61-4c9b-bd76-770df993904b">Software</a></h2>
</div>

<div id="outline-container-org18169ed" class="outline-2">
<h2 id="org18169ed"><span class="section-number-2">7.</span> <a href="20230826063851-systems_administration.html#ID-e29f43d3-c62a-4261-b04e-07b8b453dcf0">Systems Administration</a></h2>
</div>

<div id="outline-container-org9df1c7f" class="outline-2">
<h2 id="org9df1c7f"><span class="section-number-2">8.</span> <a href="20230831061049-it_security.html#ID-05aa4c77-b4bd-4983-9f2e-cac13b7baf84">IT Security</a></h2>
</div>
</div>
</body>
</html>
